waveFoam/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevation
{
    type waveGauge;

    pointDistribution userDefinedDistribution;
    N 6;
    xValues nonuniform 6(-0.15 0.025 0.15 0.3 0.45 0.6);
    yValues nonuniform 6(0.45 0.45 0.45 0.45 0.45 0.45);
    zValues nonuniform 6(-0.4 -0.4 -0.4 -0.4 -0.4 -0.4);
    
//yValues uniform -0.09;
    //zValues uniform 0.005;
    add       ( 0 0 0.8);
    axis      z;

    // REQURIED ONLY FOR NEW FUNCTIONOBJECT IMPLEMENTATION
    writeControl adjustableRunTime;
    writeInterval 0.025;
}


// ************************************************************************* //
